[{"name": "Long Nguyen Resume-26-11-2023-20-16-47", "resume": "Long Nguyen\nlongnguyen.vhoang@gmail.com | (437)-440-4756 | LinkedIn | Github\nAddress: Toronto, ON, M4Y 0E8\n\nPROFILE HIGHLIGHTS\n●\t8-month full-time (co-op) experience working as a Quality Assurance Automation Developer at the Ministry of Children Community and Social Services Ontario\n●\tGraduated from the Advanced Diploma - Computer Programming & Analysis at Seneca College of Applied Arts and Technology with a GPA of 3.6/4.0; completed the Google IT Automation Certificate \n●\tExcellent communication (understanding and translating technical languages to non-technical stakeholders) and teamwork skills developed through the experience of collaborating with developers and business managers. \n●\tTechnical skills: Java, Kotlin, Selenium, Appium, Jenkins, Jira, Cucumber, Github.\n\nWORK EXPERIENCE \nQA - Automation Developer (Full-time Co-op) \nMinistry of Children Community and Social Services Ontario \nToronto, ON\t\t\t\t                                                                                                            January 2022 – August 2022\n●\tPreparation phase: Researched how Selenium works and the prerequisites for executing the test cases. \n●\tExecution phase: Identified and debugged 5 failed test cases assigned by the team lead within 2 months by using UFT One and researching UFT documentation.\n●\tReceived the tasks assigned from test case management (SQL & Python) and translated from UFT (using VB Scripting) to Selenium (Java)\n●\tDeveloped proficient communication skills in a corporate setting by attending weekly meetings to report progress to the manager and daily chat with team members on MS Teams, as well as reporting bugs on the applications to the developers. \n●\tCompletion phase: Uploaded the code to GitHub by merging the codes to the master branch and discussing among team members to avoid merge conflict.\n●\tSuccessfully conducted Continuous Integration / Continuous Deployment (CI/CD) using Jenkins to automate repetitive tasks such as building, testing, and deployment, allowing developers to define workflows by coding. \nAchievements: Successfully accomplished the transition from UFT/QTP (Micro Focus Unified Functional Testing) to Selenium with a team of 5 people in 5 months by researching, planning, and assigning different roles for the team; also executing the transition tasks with the team \n\nPROJECTS \nTheScore Test\t\t\t\t\t\t\t\t\t\t\tNovember 2023 – Current\n-\tWriting test using Appium, Cucumber, Selenium and Kotlin to execute smoke test on TheScore App (Android platform).\n-\tSuccessfully writing drivers, finding elements and code structure, easy to maintain in the future.\n-\tThe test using Cucumber focuses on defining and testing the behaviour - (BDD behaviour-driven development testing) of an application from a user's perspective\nJarvis Job Advisor\t\t\t\t\t\t\t\t\t\t          July 2023 – Oct 2023\n-\tWriting a personalized cover letter based on a resume and job description is more specific. \n-\tTechnology Stack: Developed using Streamlit, Streamlit Extra, and Lottie for an interactive UI.\n-\tAutomated Cover Letters: Leverages OpenAI API to create tailored cover letters based on user resumes and job descriptions.\n-\tResume Support: Provides actionable suggestions to enhance resumes and allows for on-system storage.\n-\tTime-Efficiency: Designed to streamline mass job applications, saving users time.\n\nEDUCATION \nAdvanced Diploma in Computer Programming & Analysis\t                                                             2020 - 2023\nSeneca College of Applied Arts and Technology (Graduated), Toronto, ON\t\n\nReferences: Available upon request\n"}]