[{"name": "Long bo doi-31-08-2023-02-10-13", "resume": "`TECHNICAL SKILLS:\nProgramming Languages:\nC/C++, Java, C#.Net, Visual Basic\nJavascript, Typescript, HTML5, CSS\nFrameworks/ Platforms:\nNextJS, ReactJs, AngularJS, NodeJS\nES6, ASP.NET\nBootstrap, jQuery, Material UI, Tailwind CSS, Three.JS\nDatabase Management Systems:\nMS SQL Server, MySQL\nData Structure & Algorithms\nMongoDB\nPostman\nGit\nTesting Framework:\nSelenium\nCI/CD tool:\nJenkins\nYAML\nIDE:\nVisual Studio\nCode Visual Studio 2019\nIntellij IDEA\nAndroid Studio\nCloud:\nMicrosoft Azure\nAWS\nDAW:\nFL Studio, Cubase\nGame Developer:\nUnreal Engine 4\nBlender, Mixamo\n\nEDUCATION\n2020 - 2023 (graduated)\nSeneca College of Applied Arts and Technology\nComputer Programming & Analysis\n\nCERTIFICATE\nGoogle IT Automation Certificate\n\nPROFESSIONAL EXPERIENCE\nQA Automation Developer - Ministry of Children Community and Social Services Ontario: Jan 2022 - Aug 2022\n-Proficient in Java, J2EE, and Jenkins; strong in OOP, data structures, algorithms, SDLC, web tech, DB, OS, and productivity tools; excellent communication, problem-solving, and organizational skills.\n- Test automation work helps to reduce 60-80 percent of bugs.\nMoving from UFT/QTP to Selenium to easier maintenance in the future. Also,\nproviding more functionality and improving performance than UFT/QTP. I was part of a strategic shift from HP QTP/UFT, which utilized Visual Basic, to Selenium. This transition was driven by the need for a more efficient, maintainable, and debuggable testing framework. As a key member of this transition, I gained in-depth knowledge and hands-on experience with Selenium, specifically leveraging its capabilities with JavaScript. This experience honed my technical skills and enhanced my adaptability and ability to learn new technologies quickly.\n- Test automation expert with UFT and QTP experience, proficient in VB Scripting,\nSQL, and Python. Strong UFT foundation, desirable Java Selenium, Jenkins\nknowledge. Experience in Business Relationship Management. Strong leadership,\ncommunication, and collaboration skills.\n\n\nChatbot using PyTorch: Jan 2023 - Mar 2023\nUsing PyThorch to train data and generate data files.\nDesigned API using Flask and deployed to Azure using ACR and Docker.\n\nUpload Fragment: Jan 2023 - Mar 2023\nWrite, test, and deploy applications to AWS, Docker\nA fragment is defined as any piece of text, JSON data, or an image and saves the uploaded file\n\nGame Design: Aug 2022 - Jan 2023\nUsing Unreal Engine 4 to remake the AoV (Arena Of Valor) Moba game\nUsing Unreal Engine 4 to design a Pokemon game with a new concept.\n\nSpotify Favourite Personal Category: Jul 2021 - Aug 2021\nThey are designed and coded servers using Node JS, Express JS, and MongoDB for the database. Create API using NodeJs.\nDesign the UI using Angular, Material UI, Bootstrap, Lodash\nDesign a search engine to find the song based on the user's typing\nDeploy API to Heroku and App to Netlify.\n\nPROFILE\nHaving a strong foundation in software engineering and programming principles across multiple platforms.\nExperienced in object-oriented programming; developing, testing and debugging code; designing interfaces; and administering systems and networks. \nQuickly learn and use new technologies, successfully working in teams and self-directed settings.\n`"}]